{
  "Abyss:AbyssalSphere": {
    "NAME": "Abyssal Sphere",
    "DESCRIPTIONS": [
      "Jutting from the chaotic terrain around you, a bony sphere surrounds a mysterious glowing object within. NL While you are curious what lies inside, you notice some horrors keeping an eye on it.",
      "As soon as you strike the sphere, the horrors spring to life around you!",
      "No need to be greedy."
    ],
    "OPTIONS": [
      "[Open Sphere] #rFight. #gReward: #gRare #gRelic.",
      "[Leave]",
      "[Fight]"
    ]
  },
  "Abyss:CorruptedStone": {
    "NAME": "Corrupted Stone",
    "DESCRIPTIONS": [
      "Navigating through the Abyss, amidst the dark and ominous terrain, you find a #bglowing #bstone @floating@ and ~spinning~ in the air.",
      "You observe the stone. It's slow, subtle spin is mesmerizing. You shake yourself away after staring at the stone for who knows how long?",
      "Approaching carefully, you ~touch~ the #bstone. #r@Sensation@ and #p@sorrow@ flow through you, following by flashing images and sounds.",
      "#p~CORRUPTION.~ NL NL The #yseals are broken, the #bchains that once bound you shattered on the rocks. You are @free.@ NL NL You taste the air, stretching out your tentacles, drinking in the sensation of #gwarm #glife, ripe for the #gharvest, so different from the #bprison #brealm. NL NL Gathering your strength, you propel your bulk towards the sense of life..."
    ],
    "OPTIONS": [
      "[Observe] #gAdd #ga #gColorless #gcard #gto #gyour #gdeck.",
      "[Touch] #gAdd #ga #gpowerful #gcard #gto #gyour #gdeck. #rLose #r{0} #rMax #rHP.",
      "[Bypass]",
      "[Continue]",
      "[Leave]"
    ]
  },
  "Abyss:ElderBehemoth": {
    "NAME": "Elder Behemoth",
    "DESCRIPTIONS": [
      "Navigating a quiet area of the Abyss, you #b@startle@ as you find yourself face to face with a #rbehemoth far larger than any you've seen before. Astonishingly, it #gcamouflaged itself perfectly until you were right in front of it. NL NL Thankfully, rather than being aggressive, it almost seems like it's waiting for something. Perhaps if you give it an offering, it will let you pass?",
      "You decide to offer the behemoth something...",
      "You offer the behemoth only your #gappreciation. It brings its head close to you... then #glicks you. NL NL However, it also grazes you with its massive #ytusks. You've lost a bit of #rblood, but you feel #ghale #gand #ghearty.",
      "You offer the behemoth a #yshiny #yrelic. The behemoth crunches down on the #yrelic, seeming like it enjoys the meal. NL NL After it finishes, it leaves behind some of its #bshed #bteeth, which turn out to be very useful material for upgrading your equipment.",
      "You offer the behemoth some of your power. It gives the offering a questioning look, but accepts it and lets you pass.",
      "You offer the behemoth some of your power. It accepts the offering with fierce vigor and gives you some of its power in return."
    ],
    "OPTIONS": [
      "[Continue]",
      "[Appreciative] #gHeal #g{0} #gHP. #rLose #r{1} #rMax #rHP.",
      "[Golden] #gUpgrade #g{0} #grandom #gcards. #rLose {1}",
      "[Locked] Requires {0}.",
      "[Vampiric] #gGain #g{0} #gMax #gHP. #rLose {1}.",
      "[Ghostly] #gGain #g{0} #gMax #gHP #gand {1}. #rLose {2}.",
      "[Gilded] #gGain #g{0} #ggold. #rLose #r{1}.",
      "[Elemental] #gGain #g{0} #gMax #gHP #gand {1}. #rLose {2}.",
      "[Magical] #rLose {0}.",
      "[Exceptional] #gGain {0}. #rLose {1}.",
      "[Useful] #rLose {0}.",
      "[Leave]"
    ]
  },
  "Abyss:HungryVoid": {
    "NAME": "Hungry Void",
    "DESCRIPTIONS": [
      "Ahead you spot a place of even deeper darkness, and feel a #pmysterious #pforce pulling you towards it. NL NL Off balance, you take an involuntary step towards it and feel and hear something crunch beneath your feet. Looking down, the floor here is littered with broken crystals. NL NL The #pforce is getting hard to resist. You have to act fast.",
      "Grasping for something to defend yourself with, you grab a handful of #bbroken #bcrystals from the floor, holding them out in front of you as a crude shield. The pull lessens somewhat, allowing you to escape. NL NL The crystals seem #yenergized, while you feel #pdrained.",
      "With how strong the pull is, you decide the best way out is through. You rush towards the source of the pull, building momentum, and leap past the #pdarkness in your mad dash to the other side. NL NL You came close enough to be touched by the power of this dark place, and you feel #ginvigorated but #rtwisted.",
      "You stand your ground and, step by laborious step, fight again the pull. The pull seems to grow stronger with each step you take, as does the sense that the #pdarkness #rhungers for you. NL NL A bit of your #ygold is sucked away and lost forever, but you're able to escape."
    ],
    "OPTIONS": [
      "[Shield Yourself] #gAdd #g{0} {1} #gto #gyour #gdeck. #rLose #r{2} #rHP.",
      "[Accept the Pull] #gHeal #g{0} #gHP. #rBecome #rCursed #r- #rTwisted.",
      "[Drag Yourself Away] #rLose #r{0} #rGold.",
      "[Leave]"
    ]
  },
  "Abyss:Humming": {
    "NAME": "Humming",
    "DESCRIPTIONS": [
      "Deep in the Abyss, you continue onwards, you hear a faint #y~humming~ at the edge of your hearing. Curious, you follow the sound to its source, and find an area that is almost... #gpeaceful. The sense of #rhunger #rand #rdesolation that you've felt since entering this place fades away, leaving you with a sense of calm and stability. NL NL Following the sound to its source, you find a small building with a #bcrystal inside, floating above an intricate mechanism. The craftsmanship of the #bcrystal is masterful.",
      "Touching the #bcrystal, a jolt of energy runs through you. You can feel your mind become more focused.",
      "Basking in the energy of the #bcrystal, you let it seep into you. You carry a bit of of the #bcrystal's energy with you know, against the horrors of the Abyss.",
      "You decide to leave the crystal alone. It's probably doing something important."
    ],
    "OPTIONS": [
      "[Purify] #gRemove #ga #gcard #gfrom #gyour #gdeck.",
      "[Energize] #gGain {0}.",
      "[Leave]",
      "Choose a Card to Remove"
    ]
  },
  "Abyss:SpawningGrounds": {
    "NAME": "SpawningGrounds",
    "DESCRIPTIONS": [
      "You've wandered into a tunnel complex full of eggs, large and small and all sizes in between. The room is shadowy in the faint light, but you can see #ymany-limbed #ycreatures scuttling around the chamber, and the ground is covered with #psludge. NL NL You're about to turn back to find a safer path when you see a #yglimmer as something within catches the faint light. Disturbing the eggs will invite retaliation, but perhaps there's treasure within?",
      "Making your way to where you saw the #yglimmer, you move quickly but step carefully to not disturb the eggs. The source turns out to be a collection of useful equipment... #rswords, #gdaggers, #bclaws, #pstaves. As you grab some of it to take with you, the pile @clatters@ to the ground! NL NL You rush for the exit, but suffer several #rbites from the creatures on the way out.",
      "You turn back to look for a safer path."
    ],
    "OPTIONS": [
      "[Enter] #gUpgrade #ga #gcard. #rTake #r{0} #rdamage.",
      "[Turn Back]",
      "[Leave]",
      "Select a Card to Upgrade."
    ]
  },
  "Abyss:BigGameHunter": {
    "NAME": "Big Game Hunter",
    "DESCRIPTIONS": [
      "Navigating the desolate abyss, you come across a strangely dressed figure setting up camp. It's covered in so much gear and carrying so many weapons that you can't tell what the creature itself looks like under all of it. As you approach, the figure turns and greets you. NL NL \"Ho there, friend!\" he shouts at you. \"You must be here to hunt exotic game, the same reason I am! The #yhorrors and #yprimordials of this place make beings of craft and magic pale by comparison. Let me tell you about all the #g@exhilirating@ things I've seen!\" NL NL The figure regales you with tales of its exploits.",
      "Finally, after a story about hunting #ydiabolic #yabyssals, the figure switches topics. \"If you're this deep in, I don't have that much more to offer you. You already have my respect. So let me teach you one final trick... but be warned, it'll take a bit of #r~blood~ to make it work.\"",
      "\"Always a #gpleasure to meet a fellow #bhunter!\" The figure wishes you luck in your hunting as you leave."
    ],
    "OPTIONS": [
      "[Listen]",
      "[Learn] #gGain {0}. #rLose #r{1} #rMax #rHP.",
      "[Trade] #gGain {0}. #rLose {1}.",
      "[Locked] Requires Hunter's Knife.",
      "[Trade] #gGain {0} #gand #g{1} #gMax #gHP. #rLose {2}.",
      "[Locked] Requires one of the hunter's relics.",
      "[Leave]"
    ]
  }
}